{
  "showContactDetails": "Show contact info",
  "fullName": "Patryk Szram",
  "welcome": "Hello, I’m",
  "protected": "Spam protection active",
  "protecting": "Guarding against spam...",
  "positions": ["Senior Frontend Developer", "Fullstack Web Developer"],
  "bio": [
    "For a decade, I have been developing my skills as a programmer, gaining experience in web development, specializing in designing responsive web applications tailored to the business needs of clients. I am an engaged, self-taught learner, understanding good programming practices, business goals, and client project requirements.",
    "My readiness to tackle challenges has always been my hallmark. I'm intrigued by all aspects of web development, from application architecture to code development/maintenance, optimization, and process automation. I also have graphic design skills supported by professional experience in UX/UI and understand the processes of designing materials for print/publication."
  ],
  "header": {
    "skills": "Skills",
    "technologies": "Technologies",
    "tools": "Tools",
    "experience": "Experience",
    "courses": "Courses"
  },
  "skills": {
    "scrum": "Working in Scrum/Agile",
    "understandingBusinessGoals": "Understanding business goals",
    "adaptingToNewTechnologies": "Adapting to new technologies",
    "planningScalableArchitecture": "Planning scalable architecture",
    "ensuringAppQualityTesting": "Ensuring app quality and testing",
    "empathyInTeamRelationships": "Empathy in team relationships",
    "proactiveEfficiencySeeking": "Proactive efficiency seeking",
    "independenceAndInitiative": "Independence and initiative",
    "creativityInProblemSolving": "Creativity in problem-solving",
    "abilityToLearnQuickly": "Ability to learn quickly",
    "uxUiInterfaceDesign": "UX/UI interface design"
  },
  "technologies": {
    "javascriptTypescript": "JavaScript/TypeScript",
    "angularVue": "Angular/Vue",
    "phpSql": "PHP/SQL",
    "sassLess": "SASS/LESS",
    "materialUiBootstrap": "Material UI/Bootstrap",
    "pwaSpa": "PWA/SPA",
    "linuxOsx": "LINUX/OS X",
    "git": "GIT"
  },
  "tools": {
    "googleCloud": "Google Cloud Platform",
    "vercel": "Firebase/Vercel",
    "photoshopIllustrator": "Photoshop/Illustrator",
    "webpackBabel": "Webpack/Babel",
    "ciCd": "CI/CD",
    "nodeNpm": "NODE/NPM"
  },
  "courses": {
    "hybrid": "Be an Effective Hybrid or Remote Worker",
    "scrum": "Scrum: Advanced",
    "architecture": "Fundamentals of Software Architecture"
  },
  "city": {
    "gdz": "Grudziadz",
    "waw": "Warsaw",
    "inWaw": "in Warsaw",
    "inGda": "in Gdansk",
    "inGru": "in Grudziadz"
  },
  "country": {
    "pl": "Poland"
  },
  "jobs": {
    "eagerdevs": {
      "senior": "Under the wing of EagerDevs, I had the opportunity to work in a team responsible for designing a dedicated design system for a client from one of the Arab countries. The design system was based on the Stencil library, which compiled the components we developed into Angular technology. Using Storybook, we presented all possible configurations of components to the client, who then implemented our design system in their applications."
    },
    "raiffeisen": {
      "senior": "Maintained and developed internal CRM application for bank employees, ensuring support for clients across Europe. Ensured highest quality of application code, collaborated with UX designers on solution design and implementation. Focused on achieving at least 80% test coverage with unit tests.",
      "mid": "Advanced development of Angular framework, NgXS, and comprehensive understanding of Material Design system. Utilized key project tools to meet requirements and achieve business goals. Developed skills necessary for advancement to higher positions."
    },
    "stabilis": {
      "lead": "Responsible for comprehensive technological transformation of web applications, from technology selection to strategic planning. Rewrote application from Polymer to Vue framework, maintaining full system integrity. Designed application for creating graphs compliant with BPMN 2.0 standards, significantly improving production efficiency."
    },
    "movecloser": {
      "fullstack": "Supervision of project teams, ensuring high-quality code and effective collaboration. Technological coordination of projects, organizing training for developers. Comprehensive coordination of project implementation, from preparing the team's environment to production deployment."
    },
    "coderabbit": {
      "fullstack": "Responsible for the full project lifecycle, including architecture design, implementation, deployment, and direct client communication. Provided comprehensive project support by managing both technical aspects (coding, testing, deployment) and team relationships. Focus on work efficiency, maintaining high code quality, and ensuring client satisfaction through close collaboration and transparency in the project execution process.",
      "selfEmployed": "Self-employed"
    },
    "flash-media": {
      "developer": "Designing, creating, and maintaining numerous web projects using PHP, HTML, CSS, and JavaScript. Collaborating with graphic tools such as Photoshop and Illustrator to create attractive and functional solutions. Gaining valuable experience in designing and building various web projects, enhancing programming skills, and user interface design."
    },
    "info-biz": {
      "itspecialist": "Collaborated with an educational agency, handling office duties and preparing technological equipment for training sessions. I designed the agency's website and managed the purchase of necessary equipment for training purposes. Initially assisting with training plans, I gained the opportunity to independently conduct educational sessions on website design."
    }
  },
  "dates": {
    "present": "Present",
    "year": "year|years",
    "month": "month|months"
  },
  "months": {
    "jan": "January",
    "feb": "February",
    "mar": "March",
    "apr": "April",
    "may": "May",
    "jun": "June",
    "jul": "July",
    "aug": "August",
    "sep": "September",
    "oct": "October",
    "nov": "November",
    "dec": "December"
  }
}
